Autodesk.Revit.DB.OrdinateTextPosition
The ordinate dimension text position.
Since:
2017 Subscription Update
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateTextPosition.NextToWitnessLine
The dimension text position will be next to witness line.

Autodesk.Revit.DB.OrdinateTextPosition.EndOfWitnessLine
The dimension text position will be at the end of witness line.